Modul eFORM/Integračný manuál eFORM/Externá zbernica (USR)/GetEDocFromXML/EFORM_GETEDOCFROMXML_SOAP_V_1_0__REQ.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="http://schemas.gov.sk/ServiceBus/service/1.0">
	<soap:Header/>
	<soap:Body>
		<ns:CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<ns:serviceClass>EFORM_GETEDOCFROMXML_SOAP_V_1_0</ns:serviceClass>
			<ns:serviceParameter i:type="a:GetEDocFromXMLReq" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:a="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0">
				<a:Data>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz48R2VuZXJhbEFnZW5kYSB4bWxucz0iaHR0cDovL3NjaGVtYXMuZ292LnNrL2Zvcm0vQXBwLkdlbmVyYWxBZ2VuZGEvMS44IiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hLWluc3RhbmNlIj4NCiAgPHN1YmplY3Q+PC9zdWJqZWN0Pg0KICA8dGV4dD48L3RleHQ+DQo8L0dlbmVyYWxBZ2VuZGE+</a:Data>
				<a:FormTemplate>
					<a:Identifier>App.GeneralAgenda</a:Identifier>
					<a:Version>
						<a:Major>1</a:Major>
						<a:Minor>8</a:Minor>
					</a:Version>
				</a:FormTemplate>
			</ns:serviceParameter>
		</ns:CallService>
	</soap:Body>
</soap:Envelope>
